Revit 2027 API
FamilyInstance.flipFacing Method
The orientation of family instance facing will be flipped. If it can not be flipped, return false, otherwise return true.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool flipFacing()
Public Function flipFacing As Boolean
public:
bool flipFacing()
member flipFacing : unit -> bool
Return Value
Boolean
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace